{
  "chapters_included": ["7a"],
  "jurisdiction": "CA",
  "provider": "ICC",
  "sections": [
    {
      "chapter": "7A",
      "figures": [],
      "key": "701A",
      "number": "701A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec701A",
      "subsections": [
        {
          "figures": [],
          "key": "701A.1",
          "number": "701A.1",
          "paragraphs": [
            "This chapter applies to building materials, systems and/or assemblies used in the exterior design and construction of new buildings located within a Wildland-Urban Interface (WUI) area as defined in Section 702A."
          ],
          "refers_to": ["702A"],
          "tables": [],
          "title": "Scope"
        },
        {
          "figures": [],
          "key": "701A.2",
          "number": "701A.2",
          "paragraphs": [
            "The purpose of this chapter is to establish minimum standards for the protection of life and property by increasing the ability of a building located in any Fire Hazard Severity Zone within a State Responsibility Area (SRA) or Local Responsibility Areas (LRA) or any Wildland-Urban Interface (WUI) areas as specified in Section 701A.3.1 to resist the intrusion of flames or burning embers projected by a vegetation fire and contributes to a systematic reduction in conflagration losses."
          ],
          "refers_to": ["701", "701A.3.1"],
          "tables": [],
          "title": "Purpose"
        },
        {
          "figures": [],
          "key": "701A.3",
          "number": "701A.3",
          "paragraphs": [
            "New buildings located in any Fire Hazard Severity Zone or any Wildland-Urban Interface (WUI) area designated by the enforcing agency constructed after the application date shall comply with the provisions of this chapter. This shall include all new buildings with residential, commercial, educational, institutional or similar occupancy type use, which shall be referred to in this chapter as “applicable building(s)” (see definition in Section 702A), as well as new buildings and structures accessory to those applicable buildings (see Exceptions 1 and 4).",
            "Exceptions:",
            "1.Group U occupancy accessory buildings of any size located at least 50 feet (15 240 mm) from an applicable building on the same lot.",
            "2. Group U occupancy agricultural buildings, as defined in Section 202 of this code of any size located at least 50 feet (15 240 mm) from an applicable building.",
            "3. Group C occupancy special buildings conforming to the limitations specified in Section 450.4.1.",
            "4. New accessory buildings and miscellaneous structures specified in Section 710A shall comply only with the requirements of that section.",
            "5. Additions to and remodels of buildings originally constructed prior to July 1, 2008."
          ],
          "refers_to": ["702A", "710A"],
          "tables": [],
          "title": "Application"
        },
        {
          "figures": [],
          "key": "701A.3.1",
          "number": "701A.3.1",
          "paragraphs": [
            "New buildings for which an application for a building permit is submitted on or after July 1, 2008 located in any Fire Hazard Severity Zone or Wildland-Urban Interface area shall comply with all sections of this chapter, including all the following areas:",
            "1.All unincorporated lands designated by the State Board of Forestry and Fire Protection as State Responsibility Area (SRA) including:",
            "1.1.Moderate Fire Hazard Severity Zones.",
            "1.2.High Fire Hazard Severity Zones.",
            "1.3.Very-High Fire Hazard Severity Zones.",
            "2.Land designated as Very-High Fire Hazard Severity Zone by cities and other local agencies.",
            "3.Land designated as a Wildland-Urban Interface area by cities and other local agencies.",
            "Exceptions:",
            "1.New buildings located in any Fire Hazard Severity Zone within a State Responsibility Area, for which an application for a building permit is submitted on or after January 1, 2008, shall comply with all sections of this chapter.",
            "2.New buildings located in any Fire Hazard Severity Zone within a State Responsibility Area, or any Wildland-Urban Interface area designated by cities and other local agencies for which an application for a building permit is submitted on or after December 1, 2005, but prior to July 1, 2008, shall only comply with the following sections of this chapter:",
            "2.1.Section 705A – Roofing.",
            "2.2.Section 706A – Attic Ventilation."
          ],
          "refers_to": ["705A", "706A"],
          "tables": [],
          "title": "Application date and where required"
        },
        {
          "figures": [],
          "key": "701A.4",
          "number": "701A.4",
          "paragraphs": [
            "Building permit applications and final completion approvals for buildings within the scope and application of this chapter shall comply with the following:",
            "1.Building permit issuance. The local building official shall, prior to construction, provide the owner or applicant a certification that the building as proposed to be built complies with all applicable state and local building standards, including those for materials and construction methods for wildfire exposure as described in this chapter. Issuance of a building permit by the local building official for the proposed building shall be considered as complying with this section.",
            "2.Building permit final. The local building official shall, upon completion of construction, provide the owner or applicant with a copy of the final inspection report that demonstrates the building was constructed in compliance with all applicable state and local building standards, including those for materials and construction methods for wildfire exposure as described in this chapter. Issuance of a certificate of occupancy by the local building official for the proposed building shall be considered as complying with this section."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Inspection and certification"
        },
        {
          "figures": [],
          "key": "701A.5",
          "number": "701A.5",
          "paragraphs": [
            "Prior to building permit final approval, the property shall be in compliance with the vegetation management requirements prescribed in California Fire Code Section 4906, including California Public Resources Code 4291 or California Government Code Section 51182. Acceptable methods of compliance inspection and documentation shall be determined by the enforcing agency and shall be permitted to include any of the following:",
            "1.Local, state or federal fire authority or designee authorized to enforce vegetation management requirements.",
            "2.Enforcing agency.",
            "3.Third party inspection and certification authorized to enforce vegetation management requirements.",
            "4.Property owner certification authorized by the enforcing agency."
          ],
          "refers_to": ["906"],
          "tables": [],
          "title": "Vegetation management compliance"
        }
      ],
      "title": "SECTION  SCOPE, PURPOSE AND APPLICATION"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "703A",
      "number": "703A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec703A",
      "subsections": [
        {
          "figures": [],
          "key": "703A.1",
          "number": "703A.1",
          "paragraphs": [
            "Building material, systems, assemblies and methods of construction used in this chapter shall be in accordance with Section 703A."
          ],
          "refers_to": ["703A"],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "703A.2",
          "number": "703A.2",
          "paragraphs": [
            "Material and material assemblies tested in accordance with the requirements of Section 703A shall be accepted for use when the results and conditions of those tests are met. Product evaluation testing of material and material assemblies shall be approved or listed by the State Fire Marshal, or identified in a current report issued by an approved agency."
          ],
          "refers_to": ["703A"],
          "tables": [],
          "title": "Qualification by testing"
        },
        {
          "figures": [],
          "key": "703A.3",
          "number": "703A.3",
          "paragraphs": [
            "Product evaluation testing shall be performed by an approved agency as defined in Section 1702. The scope of accreditation for the approved agency shall include building product compliance with this code."
          ],
          "refers_to": ["702"],
          "tables": [],
          "title": "Approved agency"
        },
        {
          "figures": [],
          "key": "703A.4",
          "number": "703A.4",
          "paragraphs": [
            "Material and material assemblies tested in accordance with the requirements of Section 703A shall bear an identification label showing the fire test results. That identification label shall be issued by a testing and/or inspecting agency approved by the State Fire Marshal.",
            "1. Identification mark of the approved testing and/or inspecting agency.",
            "2. Contact and identification information of the manufacturer.",
            "3. Model number or identification of the product or material.",
            "4. Pre-test weathering specified in this chapter.",
            "5. Compliance standard as described under Section 703A.7."
          ],
          "refers_to": ["703", "703A", "703A.7"],
          "tables": [],
          "title": "Labeling"
        },
        {
          "figures": [],
          "key": "703A.5",
          "number": "703A.5",
          "paragraphs": [],
          "refers_to": [],
          "tables": [],
          "title": "Weathering and surface treatment protection"
        },
        {
          "figures": [],
          "key": "703A.5.1",
          "number": "703A.5.1",
          "paragraphs": [
            "Material and material assemblies tested in accordance with the requirements of Section 703A shall maintain their fire test performance under conditions of use, when installed in accordance with the manufacturers instructions."
          ],
          "refers_to": ["703A"],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "703A.5.2",
          "number": "703A.5.2",
          "paragraphs": [
            "Fire-retardant-treated wood and fire-retardant-treated wood shingles and shakes shall meet the fire test performance requirements of this chapter after being subjected to the weathering conditions contained in the following standards, as applicable to the materials and the conditions of use."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Weathering"
        },
        {
          "figures": [],
          "key": "703A.5.2.1",
          "number": "703A.5.2.1",
          "paragraphs": [
            "Fire-retardant-treated wood shall be tested in accordance with ASTM D2898 (Method A) and the requirements of Section 2303.2."
          ],
          "refers_to": ["898"],
          "tables": [],
          "title": "Fire-retardant-treated wood"
        },
        {
          "figures": [],
          "key": "703A.5.2.2",
          "number": "703A.5.2.2",
          "paragraphs": [
            "Fire-retardant-treated wood shingles and shakes shall be approved and listed by the State Fire Marshal in accordance with Section 208(c), Title 19 California Code of Regulations."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Fire-retardant-treated wood shingles and shakes"
        },
        {
          "figures": [],
          "key": "703A.5.3",
          "number": "703A.5.3",
          "paragraphs": [
            "The use of paints, coatings, stains or other surface treatments are not an approved method of protection as required in this chapter."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Surface treatment protection"
        },
        {
          "figures": [],
          "key": "703A.6",
          "number": "703A.6",
          "paragraphs": [
            "The enforcing agency is permitted to modify the provisions of this chapter for site-specific conditions in accordance with Section 1.11.2.4. When required by the enforcing agency for the purposes of granting modifications, a fire protection plan shall be submitted in accordance with the California Fire Code, Chapter 49."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Alternates for materials, design, tests and methods of construction"
        },
        {
          "figures": [],
          "key": "703A.7",
          "number": "703A.7",
          "paragraphs": [
            "The State Fire Marshal standards for exterior wildfire exposure protection listed below and as referenced in this chapter are located in the California Referenced Standards Code, Part 12 and Chapter 35 of this code.",
            "SFM Standard 12-7A-1, Exterior Wall Siding and Sheathing. A fire resistance test standard consisting of a 150 kW intensity direct flame exposure for a 10-minute duration.",
            "SFM Standard 12-7A-2, Exterior Windows. A fire resistance test standard consisting of a 150 kW intensity direct flame exposure for an 8-minute duration.",
            "SFM Standard 12-7A-3, Horizontal Projection Underside A fire resistance test standard consisting of a 300 kW intensity direct flame exposure for a 10-minute duration.",
            "SFM Standard 12-7A-4, Decking. A two-part test consisting of a heat release rate (Part A) deck assembly combustion test with an under deck exposure of 80 kW intensity direct flame for a 3-minute duration, and a (Part B) sustained deck assembly combustion test consisting of a deck upper surface burning ember exposure with a 12 mph wind for 40 minutes using a 2.2lb (1kg) burning “Class A” size 12\" x 12\" x 2.25\" (300 mm x 300 mm x 57 mm) roof test brand.",
            "SFM Standard 12-7A-4A, Decking Alternate Method A. A heat release rate deck assembly combustion test with an under deck exposure of 80 kW intensity direct flame for a 3-minute duration.",
            "ASTM D2898 Standard Practice for Accelerated Weathering of Fire-Retardant-Treated Wood for Fire Testing.",
            "ASTM D3909/D3909M Standard Specification for Asphalt Roll Roofing (Glass Felt) Surfaced with Mineral Granules.",
            "ASTM E84 Standard Test Method for Surface Burning Characteristics of Building Materials.",
            "ASTM E119 Standard Test Methods for Fire Tests of Building Construction and Materials.",
            "ASTM E2632/E2632M Standard Test Method for Evaluating the Under-Deck Fire Test Response of Deck Materials.",
            "ASTM E2707 Standard Test Method for Determining Fire Penetration of Exterior Wall Assemblies Using a Direct Flame Impingement Exposure.",
            "ASTM E2726/E2726M Standard Test Method for Evaluating the Fire Test Response of Deck Structures to Burning Brands.",
            "ASTM E2768 Standard Test Method for Extended Duration Surface Burning Characteristics of Building Materials (30-minute Tunnel Test).",
            "ASTM E2886/E2886M Standard Test Method for Evaluating the Ability of Exterior Vents to Resist the Entry of Embers and Direct Flame Impingement.",
            "ASTM E2957 Standard Test Method for Resistance to Wildfire Penetration of Eaves, Soffits and Other Projections.",
            "NFPA 257 Standard on Fire Test for Window and Glass Block Assemblies.",
            "UL 263 Standard for Fire Tests of Building Construction and Materials.",
            "UL 723 Standard for Test for Surface Burning Characteristics of Building Materials."
          ],
          "refers_to": [
            "707",
            "723",
            "726",
            "726",
            "768",
            "886",
            "886",
            "898",
            "909",
            "909",
            "957"
          ],
          "tables": [],
          "title": "Standards of quality"
        }
      ],
      "title": "SECTION  STANDARDS OF QUALITY"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "704A",
      "number": "704A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec704A",
      "subsections": [
        {
          "figures": [],
          "key": "704A.1",
          "number": "704A.1",
          "paragraphs": [
            "The materials prescribed herein for ignition resistance shall conform to the requirements of this chapter."
          ],
          "refers_to": [],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "704A.2",
          "number": "704A.2",
          "paragraphs": [
            "Ignition-resistant materials shall comply with one of the following:",
            "1.The requirements in Section 704A.3, or",
            "2.One of the alternative methods in Section 704A.4."
          ],
          "refers_to": ["704", "704", "704A.3", "704A.4"],
          "tables": [],
          "title": "Ignition-resistant materials."
        },
        {
          "figures": [],
          "key": "704A.3",
          "number": "704A.3",
          "paragraphs": [
            "The material shall comply with the conditions of acceptance in Items 1 and 2 below or with the conditions of acceptance of ASTM E2768.",
            "1.The material shall exhibit a listed flame spread index not exceeding 25 when tested in accordance with ASTM E84 or UL 723.",
            "2.Additionally, the ASTM E84 or UL 723 test shall be continued for an additional 20-minute period, and the material shall exhibit a flame front that does not progress more than 101/2 feet (3200 mm) beyond the centerline of the burner at any time during the test period."
          ],
          "refers_to": ["723", "723", "768"],
          "tables": [],
          "title": "Conditions of acceptance for ignition-resistant materials."
        },
        {
          "figures": [],
          "key": "704A.3.1",
          "number": "704A.3.1",
          "paragraphs": [
            "Wood structural panels shall be tested with a ripped or cut longitudinal gap of 1/8 inch (3.2 mm)."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Fire testing of wood structural panels."
        },
        {
          "figures": [],
          "key": "704A.4",
          "number": "704A.4",
          "paragraphs": [
            "Any one of the following shall be accepted as meeting the definition of ignition-resistant material:",
            "1.Noncombustible material. Material that complies with the definition for noncombustible materials in Section 202.",
            "2.Fire-retardant-treated wood. Fire-retardant-treated wood identified for exterior use that complies with the requirements of Section 2303.2.",
            "3.Fire-retardant-treated wood shingles and shakes. Fire-retardant-treated wood shingles and shakes, as defined in Section 1505.6 and listed by State Fire Marshal for use as “Class B” roof covering, shall be accepted as an ignition-resistant wall covering material when installed over solid sheathing."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Alternative methods for determining ignition-resistant material"
        }
      ],
      "title": "SECTION  IGNITION-RESISTANT CONSTRUCTION"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "705A",
      "number": "705A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec705A",
      "subsections": [
        {
          "figures": [],
          "key": "705A.1",
          "number": "705A.1",
          "paragraphs": [
            "Roofs shall comply with the requirements of Chapter 7A and Chapter 15. Roof assemblies in Fire Hazard Severity Zones shall be tested in accordance with ASTM E108 or UL 790 and meet a Class A fire classification. For additional compliance see Chapter 15, Section 1505.2 for Class A roof assemblies. The roof assembly shall be installed in accordance with its listing and the manufacturer’s installation instructions.",
            "The entire roof covering of every existing structure where more than 50 percent of the total roof area is replaced within any 1-year period; the entire roof covering of every new structure; and any roof covering applied in the alteration, repair, or replacement of the roof of every existing structure shall be a fire-retardant roof covering that meets a Class A fire classification."
          ],
          "refers_to": ["790"],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "705A.2",
          "number": "705A.2",
          "paragraphs": [
            "Where there is a void under theroof covering it shall comply with Section 705A.2.1 or 705A.2.2."
          ],
          "refers_to": ["705", "705", "705A.2.1", "705A.2.2"],
          "tables": [],
          "title": "Roof covering voids."
        },
        {
          "figures": [],
          "key": "705A.2.1",
          "number": "705A.2.1",
          "paragraphs": [
            "Where the roofing profile has an airspace under the roof covering, installed over a combustible deck, a 72 lb. (32.7 kg) cap sheet complying with ASTM D3909 Standard Specification for “Asphalt Rolled Roofing (Glass Felt) Surfaced with Mineral Granules,” shall be installed over the roof deck. Bird stops shall be used at the eaves when the profile fits, to prevent debris at the eave. Hip and ridge caps shall be mudded in to prevent intrusion of fire or embers.",
            "Exception: Cap sheet is not required when no less than 1” of mineral wool board or other noncombustible material is located between the roofing material and wood framing or deck."
          ],
          "refers_to": ["909"],
          "tables": [],
          "title": "Airspace under roof covering."
        },
        {
          "figures": [],
          "key": "705A.2.2",
          "number": "705A.2.2",
          "paragraphs": [
            "A Class A fire classification roof underlayment, tested in accordance with ASTM E108 or UL 790, shall be permitted to be used. If the sheathing consists of exterior fire-retardant-treated wood, the underlayment shall not be required to comply with a Class A classification. Bird stops shall be used at the eaves when the profile fits, to prevent debris at the eave. Hip and ridge caps shall be mudded in to prevent intrusion of fire or embers."
          ],
          "refers_to": ["790"],
          "tables": [],
          "title": "Roof underlayment."
        },
        {
          "figures": [],
          "key": "705A.3",
          "number": "705A.3",
          "paragraphs": [
            "Where valley flashing is installed, the flashing shall be not less than 0.019-inch (0.48 mm) No. 26 gage galvanized sheet corrosion-resistant metal installed over not less than one layer of minimum 72 pound (32.4 kg) mineral-surfaced nonperforated cap sheet complying with ASTM D3909, at least 36-inch-wide (914 mm) running the full length of the valley."
          ],
          "refers_to": ["909", "914"],
          "tables": [],
          "title": "Roof valleys"
        },
        {
          "figures": [],
          "key": "705A.4",
          "number": "705A.4",
          "paragraphs": [
            "Roof gutters shall be provided with the means to prevent the accumulation of leaves and debris in the gutter."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Roof gutters"
        }
      ],
      "title": "SECTION  ROOFING"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "706A",
      "number": "706A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec706A",
      "subsections": [
        {
          "figures": [],
          "key": "706A.1",
          "number": "706A.1",
          "paragraphs": [
            "Where provided, ventilation openings for enclosed attics, gable ends, ridge ends, under eaves and cornices, enclosed eave soffit spaces, enclosed rafter spaces formed where ceilings are applied directly to the underside of roof rafters, underfloor ventilation, foundations and crawl spaces, or any other opening intended to permit ventilation, either in a horizontal or vertical plane, shall be in accordance with Section 1202 and Sections 706A.1 through 706A.2 to resist building ignition from the intrusion of burning embers and flame through the ventilation openings."
          ],
          "refers_to": ["706", "706", "706A.1", "706A.2"],
          "tables": [],
          "title": "General."
        },
        {
          "figures": [],
          "key": "706A.2",
          "number": "706A.2",
          "paragraphs": [
            "Ventilation openings shall be fully covered with Wildfire Flame and Ember Resistant vents approved and listed by the California State Fire Marshal, or WUI vents tested to ASTM E2886 and listed, by complying with all of the following requirements:",
            "1.There shall be no flaming ignition of the cotton material during the Ember Intrusion Test.",
            "2.There shall be no flaming ignition during the Integrity Test portion of the Flame Intrusion Test.",
            "3.The maximum temperature of the unexposed side of the vent shall not exceed 662°F (350°C)."
          ],
          "refers_to": ["886"],
          "tables": [],
          "title": "Requirements."
        },
        {
          "figures": [],
          "key": "706A.2.1",
          "number": "706A.2.1",
          "paragraphs": [
            "Vents that are installed on a sloped roof, such as dormer vents, shall comply with all of the following:",
            "1.Vents shall be covered with a mesh where the dimensions of the mesh therein shall be a minimum of 1/16-inch (1.6 mm) and shall not exceed 1/8-inch (3.2 mm) in diameter.",
            "2.The mesh material shall be noncombustible.",
            "3.The mesh material shall be corrosion resistant."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Off ridge and ridge vents."
        }
      ],
      "title": "SECTION  VENTS"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "707A",
      "number": "707A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec707A",
      "subsections": [
        {
          "figures": [],
          "key": "707A.1",
          "number": "707A.1",
          "paragraphs": [
            "The provisions of this section shall govern the materials and construction methods used to resist building ignition and/or safeguard against the intrusion of flames resulting from small ember and short-term direct flame contact exposure."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Scope"
        },
        {
          "figures": [],
          "key": "707A.10",
          "number": "707A.10",
          "paragraphs": [
            "When required by the enforcing agency, the underside of overhanging appendages shall be enclosed to grade in accordance with the requirements of this chapter, or the underside of the exposed under-floor shall be protected by one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardant-treated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind the exterior covering on the underside of the appendage projection.",
            "6.The exterior portion of a 1-hour fire-resistance-rated exterior assembly, as tested in accordance with ASTM E119 or UL 263, applied to the underside of the appendage, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual.",
            "7.The underside of an appendage assembly that meets the performance criteria in Section 707A.11 when tested in accordance with the test procedures set forth in ASTM E2957.",
            "8.The underside of an appendage assembly that meets the performance criteria in accordance with the test procedures set forth in SFM Standard 12-7A-3.",
            "Exception to Section 707A.10: Structural columns and beams do not require protection when constructed with sawn lumber or glue laminated wood with the smallest minimum nominal dimension of 4 inches (102 mm). Sawn or glue-laminated planks shall be splined, tongue-and-groove, or set close together and well spiked."
          ],
          "refers_to": ["704", "704A.2", "707", "707", "707A.10", "707A.11", "957"],
          "tables": [],
          "title": "Underside of appendages."
        },
        {
          "figures": [],
          "key": "707A.11",
          "number": "707A.11",
          "paragraphs": [
            "The test shall be conducted on a minimum of three test specimens and the conditions of acceptance in Items 1 through 3 below shall be met. If any one of the three tests does not meet the conditions of acceptance, three additional tests shall be run. All of the additional tests shall meet the conditions of acceptance.",
            "1.Absence of flame penetration of the eaves or horizontal projection assembly at any time.",
            "2.Absence of structural failure of the eaves or horizontal projection subassembly at any time.",
            "3.Absence of sustained combustion of any kind at the conclusion of the 40-minute test."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Conditions of acceptance when tested in accordance with ASTM E2957."
        },
        {
          "figures": [],
          "key": "707A.2",
          "number": "707A.2",
          "paragraphs": [
            "The following exterior covering materials and/or assemblies shall comply with this section:",
            "1.Exterior wall coverings.",
            "2.Exterior wall assemblies.",
            "3.Exterior exposed underside of roof eave overhangs.",
            "4.Exterior exposed underside of roof eave soffits.",
            "5.Exposed underside of exterior porch ceilings.",
            "6.Exterior exposed underside of floor projections.",
            "7.Exterior underfloor areas.",
            "Exceptions to Section 707A.2:",
            "1.Exterior wall architectural trim, embellishments, fascias and gutters.",
            "2.Roof or wall top cornice projections and similar assemblies.",
            "3.Deck walking surfaces shall comply with Section 709A.4 only."
          ],
          "refers_to": ["707", "707A.2", "709", "709A.4"],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "707A.3",
          "number": "707A.3",
          "paragraphs": [
            "The exterior wall covering shall comply with one or more of the following requirements, except as permitted for exterior wall assemblies complying with Section 707A.4:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardant-treated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2."
          ],
          "refers_to": ["704", "704A.2", "707", "707A.4"],
          "tables": [],
          "title": "Exterior wall coverings."
        },
        {
          "figures": [],
          "key": "707A.3.1",
          "number": "707A.3.1",
          "paragraphs": [
            "Exterior wall coverings shall extend from the top of the foundation to the roof, and terminate at 2 inch (50.8 mm) nominal solid wood blocking between rafters at all roof overhangs, or in the case of enclosed eaves, terminate at the enclosure."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Extent of exterior wall covering."
        },
        {
          "figures": [],
          "key": "707A.4",
          "number": "707A.4",
          "paragraphs": [
            "Exterior wall assemblies of buildings or structures shall be constructed using one or more of the following methods, unless they are covered by an exterior wall covering complying with Section 707A.3:",
            "1.Assembly of sawn lumber or glue-laminated wood with the smallest minimum nominal dimension of 4 inches (102 mm). Sawn or glue-laminated planks splined, tongue-and-groove, or set close together and well spiked.",
            "2.Log wall construction assembly.",
            "3.Assembly that has been tested in accordance with the test procedures for a 10-minute direct flame contact exposure test set forth in ASTM E2707 with the conditions of acceptance shown in Section 707A.4.1.",
            "4.Assembly that meets the performance criteria in accordance with the test procedures for a 10-minute direct flame contact exposure test set forth in SFM Standard 12-7A-1.",
            "5.Assembly suitable for exterior fire exposure with a 1-hour fire-resistance rating, rated from the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "6.Assembly suitable for exterior fire exposure containing one layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind the exterior wall covering or cladding on the exterior side of the framing.",
            "7.Assembly suitable for exterior fire exposure containing any of the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual as complying with a 1-hour fire-resistance rating, as tested in accordance with ASTM E119 or UL 263."
          ],
          "refers_to": ["707", "707", "707", "707A.3", "707A.4.1"],
          "tables": [],
          "title": "Exterior wall assemblies."
        },
        {
          "figures": [],
          "key": "707A.4.1",
          "number": "707A.4.1",
          "paragraphs": [
            "The ASTM E2707 test shall be conducted on a minimum of three test specimens, and the conditions of acceptance in Items 1 and 2 below shall be met. If any one of the three tests do not meet the conditions of acceptance, three additional tests shall be run. All the additional tests shall meet the conditions of acceptance.",
            "1.Absence of flame penetration through the wall assembly at any time.",
            "2.Absence of evidence of glowing combustion on the interior surface of the assembly at the end of the 70- minute test."
          ],
          "refers_to": ["707"],
          "tables": [],
          "title": "Conditions of acceptance when tested in accordance with ASTM E2707."
        },
        {
          "figures": [],
          "key": "707A.5",
          "number": "707A.5",
          "paragraphs": [
            "The exposed roof deck on the underside of unenclosed roof eaves shall consist of one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardant-treated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind an exterior covering on the underside of the roof deck.",
            "6.The exterior portion of a 1-hour fire-resistance-rated exterior assembly, as tested in accordance with ASTM E119 or UL 263, applied to the underside of the roof deck designed for exterior fire exposure, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual."
          ],
          "refers_to": ["704", "704A.2"],
          "tables": [],
          "title": "Open roof eaves"
        },
        {
          "figures": [],
          "key": "707A.6",
          "number": "707A.6",
          "paragraphs": [
            "The exposed underside of enclosed roof eaves having either a boxed-in roof eave soffit with a horizontal underside, or sloping rafter tails with an exterior covering applied to the underside of the rafter tails, shall be protected by one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardanttreated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind the exterior covering or cladding on the underside of the rafter tails or soffit.",
            "6.The exterior portion of a 1-hour fire-resistive exterior assembly applied to the underside of the rafter tails or soffit, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual.",
            "7.Boxed-in roof eave soffit assemblies with a horizontal underside that meet the performance criteria in Section 707A.11 when tested in accordance with the test procedures set forth in ASTM E2957.",
            "8.Boxed-in roof eave soffit assemblies with a horizontal underside that meet the performance criteria in accordance with the test procedures set forth in SFM Standard 12-7A-3."
          ],
          "refers_to": ["704", "704A.2", "707", "707A.11", "957"],
          "tables": [],
          "title": "Enclosed roof eaves and roof eave soffits."
        },
        {
          "figures": [],
          "key": "707A.7",
          "number": "707A.7",
          "paragraphs": [
            "The exposed underside of exterior porch ceilings shall be protected by one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardanttreated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind the exterior covering or cladding on the underside of the rafter tails or soffit.",
            "6.The exterior portion of a 1-hour fire-resistance-rated exterior assembly, as tested in accordance with ASTM E119, applied to the underside of the ceiling assembly, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual.",
            "7.Porch ceiling assemblies with a horizontal underside that meet the performance criteria in Section 707A.11 when tested in accordance with the test procedures set forth in ASTM E2957.",
            "8.Porch ceiling assemblies with a horizontal underside that meet the performance criteria in accordance with the test procedures set forth in SFM Standard 12-7A-3."
          ],
          "refers_to": ["704", "704A.2", "707", "707A.11", "957"],
          "tables": [],
          "title": "Exterior porch ceilings"
        },
        {
          "figures": [],
          "key": "707A.8",
          "number": "707A.8",
          "paragraphs": [
            "The exposed underside of a cantilevered floor projection where a floor assembly extends over an exterior wall shall be protected by one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardant-treated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind the exterior covering on the underside of the ceiling.",
            "6.The exterior portion of a 1-hour fire-resistance-rated exterior assembly, as tested in accordance with ASTM E119, applied to the underside of the ceiling assembly, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual.",
            "7.The underside of a floor projection assembly that meets the performance criteria in Section 707A.10 when tested in accordance with the test procedures set forth in ASTM E2957.",
            "8.The underside of a floor projection assembly that meets the performance criteria in accordance with the test procedures set forth in SFM Standard 12-7A-3."
          ],
          "refers_to": ["704", "704A.2", "707", "707A.10", "957"],
          "tables": [],
          "title": "Floor projections"
        },
        {
          "figures": [],
          "key": "707A.9",
          "number": "707A.9",
          "paragraphs": [
            "The underfloor area of elevated or overhanging buildings shall be enclosed to grade in accordance with the requirements of this chapter or the underside of the exposed underfloor shall be protected by one or more of the following:",
            "1.Noncombustible material.",
            "2.Ignition-resistant material. The ignition-resistant material shall be labeled for exterior use and shall meet the requirements of Section 704A.2.",
            "3.Fire-retardant-treated wood. The fire-retardant-treated wood shall be labeled for exterior use and shall meet the requirements of Section 2303.2.",
            "4.Materials approved for not less than 1-hour fire-resistance-rated construction on the exterior side, as tested in accordance with ASTM E119 or UL 263.",
            "5.One layer of 5/8-inch (15.9 mm) Type X gypsum sheathing applied behind an exterior covering on the underside of the floor projection.",
            "6.The exterior portion of a 1-hour fire-resistance-rated exterior assembly, as tested in accordance with ASTM E119 or UL 263, applied to the underside of the floor, including assemblies using the gypsum panel and sheathing products listed in the Gypsum Association Fire Resistance Design Manual.",
            "7.The underside of a floor assembly that meets the performance criteria in Section 707A.11 when tested in accordance with the test procedures set forth in ASTM E2957.",
            "8.The underside of a floor assembly that meets the performance criteria in accordance with the test procedures set forth in SFM Standard 12-7A-3.",
            "Exception to Section 707A.9: Structural columns and beams do not require protection when constructed with sawn lumber or glue-laminated wood with the smallest minimum nominal dimension of 4 inches (102 mm). Sawn or glue-laminated planks shall be splined, tongue-and-groove, or set close together and well spiked."
          ],
          "refers_to": ["704", "704A.2", "707", "707", "707A.11", "707A.9", "957"],
          "tables": [],
          "title": "Underfloor protection."
        }
      ],
      "title": "SECTION  EXTERIOR COVERING"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "708A",
      "number": "708A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec708A",
      "subsections": [
        {
          "figures": [],
          "key": "708A.1",
          "number": "708A.1",
          "paragraphs": [],
          "refers_to": [],
          "tables": [],
          "title": "General"
        },
        {
          "figures": [],
          "key": "708A.2",
          "number": "708A.2",
          "paragraphs": [
            "The following exterior glazing materials and/or assemblies shall comply with this section:",
            "1.Exterior windows.",
            "2.Exterior glazed doors.",
            "3.Glazed openings within exterior doors.",
            "4.Glazed openings within exterior garage doors.",
            "5.Exterior structural glass veneer.",
            "6.Skylights.",
            "7.Vents."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Exterior glazing"
        },
        {
          "figures": [],
          "key": "708A.2.1",
          "number": "708A.2.1",
          "paragraphs": [
            "Exterior windows, skylights and exterior glazed door assemblies shall comply with one of the following requirements:",
            "1.Be constructed of multipane glazing with a minimum of one tempered pane meeting the requirements of Section 2406 Safety Glazing, or",
            "2.Be constructed of glass block units, or",
            "3.Have a fire-resistance rating of not less than 20 minutes when tested according to NFPA 257, or",
            "4.Be tested to meet the performance requirements of SFM Standard 12-7A-2."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Exterior windows, skylights and exterior glazed door assembly requirements"
        },
        {
          "figures": [],
          "key": "708A.2.2",
          "number": "708A.2.2",
          "paragraphs": [
            "Operable skylights shall be protected by a non-combustible mesh screen where the dimensions of the openings in the screen shall not exceed 1/8-inch (3.2 mm)."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Operable skylights"
        },
        {
          "figures": [],
          "key": "708A.2.3",
          "number": "708A.2.3",
          "paragraphs": [
            "The wall assembly behind structural glass veneer shall comply with Section 707A.3."
          ],
          "refers_to": ["707", "707A.3"],
          "tables": [],
          "title": "Structural glass veneer"
        },
        {
          "figures": [],
          "key": "708A.3",
          "number": "708A.3",
          "paragraphs": [
            "Exterior doors shall comply with one of the following:",
            "1.The exterior surface or cladding shall be of noncombustible material.",
            "2.The exterior surface or cladding shall be of ignitionresistant material.",
            "3.The exterior door shall be constructed of solid core wood that complies with the following requirements:",
            "3.1.Stiles and rails shall not be less than 13/8 inches thick.",
            "3.2.Panels shall not be less than 11/4 inches thick, except for the exterior perimeter of the panel that shall be permitted to taper to a tongue not less than 3/8 inch thick.",
            "4.The exterior door assembly shall have a fire-resistance rating of not less than 20 minutes when tested according to NFPA 252.",
            "5.The exterior surface or cladding shall be tested to meet the performance requirements of Section 707A.3.1 when tested in accordance with ASTM E2707.",
            "6.The exterior surface or cladding shall be tested to meet the performance requirements of SFM Standard 12-7A-1."
          ],
          "refers_to": ["707", "707", "707A.3.1"],
          "tables": [],
          "title": "Exterior doors"
        },
        {
          "figures": [],
          "key": "708A.3.1",
          "number": "708A.3.1",
          "paragraphs": ["Glazing in exterior doors shall comply with Section 708A.2.1."],
          "refers_to": ["708", "708A.2.1"],
          "tables": [],
          "title": "Exterior door glazing"
        },
        {
          "figures": [],
          "key": "708A.4",
          "number": "708A.4",
          "paragraphs": [
            "Exterior garage doors shall resist the intrusion of embers from entering by preventing gaps between doors and door openings, at the bottom, sides and tops of doors, from exceeding 1/8 inch (3.2 mm). Gaps between doors and door openings shall be controlled by one of the following methods:",
            "1.Weather-stripping products made of materials that: (a) have been tested for tensile strength in accordance with ASTM D638 (Standard Test Method for Tensile Properties of Plastics) after exposure to ASTM G155 (Standard Practice for Operating Xenon Arc Light Apparatus for Exposure of Non-Metallic Materials) for a period of 2,000 hours, where the maximum allowable difference in tensile strength values between exposed and non-exposed samples does not exceed 10%; and (b) exhibit a V-2 or better flammability rating when tested to UL 94, Standard for Tests for Flammability of Plastic Materials for Parts in Devices and Appliances.",
            "2.Door overlaps onto jambs and headers.",
            "3.Garage door jambs and headers covered with metal flashing."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Garage door perimeter gap."
        }
      ],
      "title": "SECTION  EXTERIOR WINDOWS, SKYLIGHTS AND DOORS"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "709A",
      "number": "709A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec709A",
      "subsections": [
        {
          "figures": [],
          "key": "709A.1",
          "number": "709A.1",
          "paragraphs": [
            "The walking surface material of decks, porches, balconies and stairs shall comply with the requirements of this section."
          ],
          "refers_to": [],
          "tables": [],
          "title": "General."
        },
        {
          "figures": [],
          "key": "709A.1.1",
          "number": "709A.1.1",
          "paragraphs": [
            "A minimum of a 6-inch (150 mm) metal flashing, applied vertically on the exterior of the wall, shall be installed at all deck-to-wall intersections."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Flashing."
        },
        {
          "figures": [],
          "key": "709A.2",
          "number": "709A.2",
          "paragraphs": [
            "The walking surface material of decks, porches, balconies and stairs shall comply with the requirements of this section when any portion of such surface is within 10 feet (3048 mm) of the building."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Where required"
        },
        {
          "figures": [],
          "key": "709A.3",
          "number": "709A.3",
          "paragraphs": [
            "The walking surface material of decks, porches, balconies and stairs shall be constructed with one of the following materials:",
            "1.Material that complies with the performance requirements of Section 709A.4 when tested in accordance with both ASTM E2632 and ASTM E2726.",
            "2.Ignition-resistant material that complies with the performance requirements of Section 704A.3.",
            "3.Material that complies with the performance requirements of both SFM Standard 12-7A-4 and Section 704A.3.",
            "4.Exterior fire-retardant-treated wood.",
            "5.Noncombustible material.",
            "6.Any material that complies with the performance requirements of SFM Standard 12-7A-4A when attached exterior wall covering is also composed of noncombustible or ignition-resistant material.",
            "Exception: Wall material shall be permitted to be of any material that otherwise complies with this chapter when the decking surface material complies with the performance requirements ASTM E84 with a Class B flame spread index.",
            "7.Any material that complies with the performance requirements of Section 709A.5 when tested in accordance with ASTM E2632 and when attached exterior wall covering is also composed of only noncombustible or ignition-resistant materials.",
            "Exception: Wall material shall be permitted to be of any material that otherwise complies with this chapter when the decking surface material complies with the performance requirements ASTM E84 with a Class B flame spread index."
          ],
          "refers_to": ["704", "704", "704A.3", "704A.3", "709", "709", "709A.4", "709A.5", "726"],
          "tables": [],
          "title": "Decking Surfaces"
        },
        {
          "figures": [],
          "key": "709A.4.1",
          "number": "709A.4.1",
          "paragraphs": [
            "The ASTM E2632 test shall be conducted on a minimum of three test specimens and the conditions of acceptance in Items 1 through 3 below shall be met. If any one of the three tests does not meet the conditions of acceptance, three additional tests shall be run. All of the additional tests shall meet the conditions of acceptance.",
            "1.Peak heat release rate of less than or equal to 25 kW/ft2 (269 kW/m2).",
            "2.Absence of sustained flaming or glowing combustion of any kind at the conclusion of the 40-min observation period.",
            "3.Absence of falling particles that are still burning when reaching the burner or floor."
          ],
          "refers_to": [],
          "tables": [],
          "title": "Conditions of acceptance for ASTM E2632"
        },
        {
          "figures": [],
          "key": "709A.4.2",
          "number": "709A.4.2",
          "paragraphs": [
            "The ASTM E2726 test shall be conducted, using a “Class A” size roof test brand, on a minimum of three test specimens and the conditions of acceptance in Items 1 and 2 below shall be met. If any one of the three tests does not meet the conditions of acceptance, three additional tests shall be run. All of the additional tests shall meet the conditions of acceptance.",
            "1.Absence of sustained flaming or glowing combustion of any kind at the conclusion of the 40-min observation period.",
            "2.Absence of falling particles that are still burning when reaching the burner or floor."
          ],
          "refers_to": ["726"],
          "tables": [],
          "title": "Conditions of acceptance for ASTM E2726"
        }
      ],
      "title": "SECTION  DECKING"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "710A",
      "number": "710A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec710A",
      "subsections": [
        {
          "figures": [],
          "key": "710A.1",
          "number": "710A.1",
          "paragraphs": [
            "Group U occupancy accessory buildings and miscellaneous structures that have the potential to pose a significant exterior fire exposure hazard during wildfires shall be constructed to conform to the ignition-resistance requirements of this section."
          ],
          "refers_to": [],
          "tables": [],
          "title": "General."
        },
        {
          "figures": [],
          "key": "710A.2",
          "number": "710A.2",
          "paragraphs": [
            "Unless otherwise addressed by the exceptions of Section 701A.3, the provisions of this section shall apply to buildings accessory to an applicable building on the same lot. This section shall also apply to attached and detached miscellaneous structures that require a building permit, including but not limited to trellises, arbors, patio covers, gazebos and similar structures.",
            "Exceptions:",
            "1.Decks shall comply with the requirements of Section 709A.",
            "2.Awnings and canopies shall comply with the requirements of Section 3105."
          ],
          "refers_to": ["701", "701A.3", "709A"],
          "tables": [],
          "title": "Applicability."
        },
        {
          "figures": [],
          "key": "710A.3",
          "number": "710A.3",
          "paragraphs": [
            "Miscellaneous structures that require a permit, and accessory buildings of any size, when separated from an applicable building on the same lot by a distance of less than 3 feet (914 mm), shall comply with Section 710A.3.1. Accessory buildings that are greater than 120 square feet (11.15 m2), when separated from an applicable building on the same lot by a distance of 3 feet (914 mm) or more but less than 50 feet (15 240 mm) shall comply with Section 710A.3.2.",
            "When required by the enforcing agency, miscellaneous structures that require a permit, and accessory buildings that are 120 square feet (11.15 m2) or less, when separated from an applicable building on the same lot by a distance of 3 feet (914 mm) or more but less than 50 feet (15 240 mm), shall comply with either Section 710A.3.4 or Section 710A.3.3, respectively.",
            "No requirements shall apply to accessory buildings or miscellaneous structures when located 50 feet (15 240 mm) or more from an applicable building on the same lot."
          ],
          "refers_to": [
            "710",
            "710",
            "710",
            "710",
            "710A.3.1",
            "710A.3.2",
            "710A.3.3",
            "710A.3.4",
            "914",
            "914",
            "914"
          ],
          "tables": [],
          "title": "Where required."
        },
        {
          "figures": [],
          "key": "710A.3.1",
          "number": "710A.3.1",
          "paragraphs": [
            "Miscellaneous structures that require a permit, and accessory buildings, attached to or separated from an applicable building on the same lot by a distance of less than 3 feet (914 mm), shall be constructed of noncombustible materials or of ignition-resistant materials as described in Section 704A.2."
          ],
          "refers_to": ["704", "704A.2", "914"],
          "tables": [],
          "title": "Structures and accessory buildings within 3 feet (914 mm)."
        },
        {
          "figures": [],
          "key": "710A.3.2",
          "number": "710A.3.2",
          "paragraphs": [
            "Accessory buildings that are greater than 120 square feet (11.15 m2) in size and separated from an applicable building on the same lot by a distance of 3 feet (914 mm) or more but less than 50 feet (15 240 mm) shall be constructed of noncombustible materials or of ignition-resistant materials as described in Section 704A.2."
          ],
          "refers_to": ["704", "704A.2", "914"],
          "tables": [],
          "title": "Accessory buildings greater than 120 square feet (11.15 m2), located 3 feet (914 mm) or more but less than 50 feet (15 240 mm)."
        },
        {
          "figures": [],
          "key": "710A.3.3",
          "number": "710A.3.3",
          "paragraphs": [
            "When required by the enforcing agency, accessory buildings 120 square feet (11.15 m2) or less and separated from an applicable building on the same lot by a distance of 3 feet (914 mm) or more but less than 50 feet (15 240 mm) shall be constructed of noncombustible materials or of ignition-resistant materials as described in Section 704A.2."
          ],
          "refers_to": ["704", "704A.2", "914"],
          "tables": [],
          "title": "Accessory buildings 120 square feet (11.15 m2) or less, located 3 feet (914 mm) or more but less than 50 feet (15 240 mm)."
        },
        {
          "figures": [],
          "key": "710A.3.4",
          "number": "710A.3.4",
          "paragraphs": [
            "When required by the enforcing agency, miscellaneous structures that require a permit and are separated from an applicable building on the same lot by a distance of 3 feet (914 mm) or more but less than 50 feet (15 240 mm) shall be constructed of noncombustible materials or of ignition-resistant materials as described in Section 704A.2."
          ],
          "refers_to": ["704", "704A.2", "914"],
          "tables": [],
          "title": "Miscellaneous structures located 3 feet (914 mm) or more but less than 50 feet (15 240 mm)."
        },
        {
          "figures": [],
          "key": "710A.4",
          "number": "710A.4",
          "paragraphs": [
            "Roofs of accessory buildings required to be constructed entirely of noncombustible materials or of ignition-resistant materials shall comply with the requirements of Chapter 7A and Chapter 15. Roofs shall have a roofing assembly installed in accordance with its listing and the manufacturer’s installation instructions. Roof assemblies in Fire Hazard Severity Zones shall comply with a Class A rating when tested in accordance with ASTM E108 or UL 790."
          ],
          "refers_to": ["790"],
          "tables": [],
          "title": "Roof construction."
        }
      ],
      "title": "SECTION  ACCESSORY BUILDINGS AND MISCELLANEOUS STRUCTURES"
    },
    {
      "chapter": "7A",
      "figures": [],
      "key": "711A",
      "number": "711A",
      "source_url": "https://codes.iccsafe.org/content/CABC2022P4/chapter-7-fire-and-smoke-protection-features#CABC2022P4_Ch07_Sec711A",
      "subsections": [],
      "title": "SECTION  MODEL ORDINANCE FOR FIRE HAZARD SEVERITY ZONE ADOPTION"
    }
  ],
  "source_id": "CBC",
  "source_url": "https://codes.iccsafe.org/content/CABC2022P4",
  "title": "California Building Code",
  "version": 2022
}
